//
// Created by Ovanes on 13.10.2019.
//

//Задача № 2 (5 баллов)
//Решение всех задач данного раздела предполагает использование кучи.
//2_1. Жадина.
//Вовочка ест фрукты из бабушкиной корзины. В корзине лежат фрукты разной массы. Вовочка может поднять не более K грамм. Каждый фрукт весит не более K грамм. За раз он выбирает несколько самых тяжелых фруктов, которые может поднять одновременно, откусывает от каждого половину и кладет огрызки обратно в корзину. Если фрукт весит нечетное число грамм, он откусывает большую половину. Фрукт массы 1гр он съедает полностью.
//Определить за сколько подходов Вовочка съест все фрукты в корзине.
//Формат входных данных. Вначале вводится n - количество фруктов и n строк с массами фруктов.
//n ≤ 50000.
//Затем K - "грузоподъемность". K ≤ 1000.
//Формат выходных данных. Неотрицательное число - количество подходов к корзине.

int main(int argc, char** argv)
{
    size_t result = 0;

    return result;
}