//
// Created by Ovanes on 03.11.2019.
//

//Дано число N < 106 и последовательность целых чисел из [-231..231] длиной N.
//Требуется построить бинарное дерево, заданное наивным порядком вставки.
//Т.е., при добавлении очередного числа K в дерево с корнем root, если root→Key ≤ K, то узел K добавляется в правое поддерево root;
// иначе в левое поддерево root.
//Рекурсия запрещена.

//6_4. Выведите элементы в порядке level-order (по слоям, “в ширину”).
//
//in
//3
//2 1 3
//out
//2 1 3

//in
//3
//1 2 3
//out
//1 2 3

//in
//3
//3 1 2
//out
//3 1 2

//in
//4
//3 1 4 2
//out
//3 1 4 2

int main(void){
    return 0;
}

